# AngleTolerance Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..AngleTolerance Property
Application Class See Also
---
Angle tolerance.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public double AngleTolerance { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AngleTolerance As Double
	Get
```

Visual C++
---
```text
public:
property double AngleTolerance {
	double get ();
}
```

# Remarks
Value is in radians. Two angle measurements closer than this value are considered identical. Do not use this value for any purpose other than its intended purpose, which is to check if two angles are the same within this tolerance value. Do not use this value to set the value of an angle. Doing so will result in unstable behavior.
# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace